package com.fpt.ruby.business.helper;


import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;


public class TypeMapperHelper {
	
	static Integer SAME = 20;
	static Integer MAX_LEN = 40;
		
	private static String[] to_hop = new String[]{"à","á","ạ","ả","ã","â","ầ","ấ","ậ","ẩ","ẫ","ă",
			"ằ","ắ","ặ","ẳ","ẵ","è","é","ẹ","ẻ","ẽ","ê","ề",
			"ế","ệ","ể","ễ",
			"ì","í","ị","ỉ","ĩ",
			"ò","ó","ọ","ỏ","õ","ô","ồ","ố","ộ","ổ","ỗ","ơ",
			"ờ","ớ","ợ","ở","ỡ",
			"ù","ú","ụ","ủ","ũ","ư","ừ","ứ","ự","ử","ữ",
			"ỳ","ý","ỵ","ỷ","ỹ",
			"đ",
			"à","á","ạ","ả","ã","Â","ầ","ấ","ậ","ẩ","ẫ","Ă",
			"ằ","ắ","ặ","ẳ","ẵ",
			"è","é","ẹ","ẻ","ẽ","Ê","ề","ế","ệ","ể","ễ",
			"ì","í","ị","ỉ","ĩ",
			"ò","ó","ọ","ỏ","õ","Ô","ồ","ố","ộ","ổ","ỗ","Ơ","ờ","ớ","ợ","ở","ỡ",
			"ù","ú","ụ","ủ","ũ","Ư","ừ","ứ","ự","ử","ữ",
			"ỳ","ý","ỵ","ỷ","ỹ",
			"Đ"," "
	};
	private static String[] co_dau = new String[]{
			"à", "á", "ạ", "ả", "ã", "â", "ầ", "ấ", "ậ", "ẩ", "ẫ", "ă",
			"ằ", "ắ", "ặ", "ẳ", "ẵ", "è", "é", "ẹ", "ẻ", "ẽ", "ê", "ề",
			"ế", "ệ", "ể", "ễ",
			"ì", "í", "ị", "ỉ", "ĩ",
			"ò", "ó", "ọ", "ỏ", "õ", "ô", "ồ", "ố", "ộ", "ổ", "ỗ", "ơ",
			"ờ", "ớ", "ợ", "ở", "ỡ",
			"ù", "ú", "ụ", "ủ", "ũ", "ư", "ừ", "ứ", "ự", "ử", "ữ",
			"ỳ", "ý", "ỵ", "ỷ", "ỹ",
			"đ",
			"À", "Á", "Ạ", "Ả", "Ã", "Â", "Ầ", "Ấ", "Ậ", "Ẩ", "Ẫ", "Ă",
			"Ằ", "Ắ", "Ặ", "Ẳ", "Ẵ",
			"È", "É", "Ẹ", "Ẻ", "Ẽ", "Ê", "Ề", "Ế", "Ệ", "Ể", "Ễ",
			"Ì", "Í", "Ị", "Ỉ", "Ĩ",
			"Ò", "Ó", "Ọ", "Ỏ", "Õ", "Ô", "Ồ", "Ố", "Ộ", "Ổ", "Ỗ", "Ơ", "Ờ", "Ớ", "Ợ", "Ở", "Ỡ",
			"Ù", "Ú", "Ụ", "Ủ", "Ũ", "Ư", "Ừ", "Ứ", "Ự", "Ử", "Ữ",
			"Ỳ", "Ý", "Ỵ", "Ỷ", "Ỹ",
			"Đ", " "};
	private static String[] khong_dau = new String[] { "a", "a", "a", "a", "a",
			"a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "e",
			"e", "e", "e", "e", "e", "e", "e", "e", "e", "e", "i", "i", "i",
			"i", "i", "o", "o", "o", "o", "o", "o", "o", "o", "o", "o", "o",
			"o", "o", "o", "o", "o", "o", "u", "u", "u", "u", "u", "u", "u",
			"u", "u", "u", "u", "y", "y", "y", "y", "y", "d", "A", "A", "A",
			"A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A",
			"A", "E", "E", "E", "E", "E", "E", "E", "E", "E", "E", "E", "I",
			"I", "I", "I", "I", "O", "O", "O", "O", "O", "O", "O", "O", "O",
			"O", "O", "O", "O", "O", "O", "O", "O", "U", "U", "U", "U", "U",
			"U", "U", "U", "U", "U", "U", "Y", "Y", "Y", "Y", "Y", "D", " " };
	
	
	
	public static String normalize(String name) {
		name = name.toLowerCase().trim();
		
		String[] parts = name.split("\\s+");
		name = String.join(" ", parts);
		for (int i = 0; i < co_dau.length; ++i) {
			name = name.replaceAll(co_dau[i], khong_dau[i]);
		}
		
		for (int i = 0; i < to_hop.length; ++i) {
			name = name.replaceAll(to_hop[i], khong_dau[i]);
		}
		return name;
	}
	
		
}
